Reports/РабочиеЧасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РабочиеЧасы</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ВыходныеДни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыходныеДни</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КоличествоЧасовВМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоЧасовВМесяц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочиеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочииДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/РабочиеЧасы/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омДаты.ЗаполнитьМесяцы(); 
	
	Если Месяц(ТекущаяДата()) > 6 Тогда
		ЭтаФорма.Период.ДатаНачала 		= НачалоГода(ТекущаяДата());
		ЭтаФорма.Период.ДатаОкончания 	= КонецГода(КонецГода(ЭтаФорма.Период.ДатаНачала) + 1);
	Иначе
		ЭтаФорма.Период.ДатаНачала 		= НачалоГода(НачалоГода(ТекущаяДата()) - 1);
		ЭтаФорма.Период.ДатаОкончания 	= КонецГода(КонецГода(ЭтаФорма.Период.ДатаНачала) + 1);
	КонецЕсли;
	СформироватьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ПФ = ПолучитьФорму("Отчет.РабочиеЧасы.Форма.ФормаДобавитьРабочиеЧасы");
	ПФ.НачалоПериода = ЭтаФорма.Период.ДатаНачала;
	ПФ.ОкончаниеПериода = ЭтаФорма.Период.ДатаОкончания;
	ПФ.Открыть();
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицу()
	ТабДок = ЭтаФорма.ПолеВывода;
	ТабДок.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МЕСЯЦ(ВыходныеДни.Дата) КАК НомерМесяца,
		|	ГОД(ВыходныеДни.Дата) КАК Год,
		|	СУММА(ВЫБОР
		|			КОГДА ВыходныеДни.КоличествоРабочихЧасов = 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Выходные,
		|	СУММА(ВЫБОР
		|			КОГДА ВыходныеДни.КоличествоРабочихЧасов > 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сокращенные
		|ПОМЕСТИТЬ втВыходные
		|ИЗ
		|	РегистрСведений.ВыходныеДни КАК ВыходныеДни
		|ГДЕ
		|	ВыходныеДни.Дата МЕЖДУ &МесяцН И &МесяцК
		|
		|СГРУППИРОВАТЬ ПО
		|	МЕСЯЦ(ВыходныеДни.Дата),
		|	ГОД(ВыходныеДни.Дата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоличествоЧасовВМесяц.Месяц КАК Месяц,
		|	ГОД(КоличествоЧасовВМесяц.Месяц) КАК Год,
		|	МЕСЯЦ(КоличествоЧасовВМесяц.Месяц) КАК НомерМесяца,
		|	КоличествоЧасовВМесяц.РабочиеЧасы КАК РабочиеЧасы,
		|	КоличествоЧасовВМесяц.РабочииДни КАК РабочииДни
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.КоличествоЧасовВМесяц КАК КоличествоЧасовВМесяц
		|ГДЕ
		|	КоличествоЧасовВМесяц.Месяц МЕЖДУ &МесяцН И &МесяцК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Месяцы.Наименование КАК НаименованиеМесяца,
		|	ГОД(вт.Месяц) КАК Год,
		|	вт.РабочиеЧасы КАК РабочиеЧасы,
		|	вт.Месяц КАК Месяц,
		|	втВыходные.Выходные КАК Выходные,
		|	втВыходные.Сокращенные КАК Сокращенные,
		|	вт.РабочииДни КАК РабочииДни
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Месяцы КАК Месяцы
		|		ПО вт.НомерМесяца = Месяцы.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВыходные КАК втВыходные
		|		ПО вт.НомерМесяца = втВыходные.НомерМесяца
		|			И вт.Год = втВыходные.Год
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.Месяц";
	
	Запрос.УстановитьПараметр("МесяцК", ЭтаФорма.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("МесяцН", ЭтаФорма.Период.ДатаНачала);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Макет = Отчеты.РабочиеЧасы.ПолучитьМакет("Макет");
	обШапка = Макет.ПолучитьОбласть("Шапка");
	обШапка.Параметры.Заполнить(ЭтаФорма);
	ТабДок.Вывести(обШапка);
	
	текОбласть 		= Макет.ПолучитьОбласть("Строка");
	ПустаяДата = Дата(1,1,1);
	
	Пока Выборка.Следующий() Цикл
		КоличествоДнейВМесяце = День(КонецМесяца(Выборка.Месяц));
		ДляУчета = (КоличествоДнейВМесяце - Выборка.Выходные) * 8;
		
		текОбласть.Параметры.Дата 		= Выборка.НаименованиеМесяца + " " + Формат(Выборка.Год,"ЧГ=0");
		текОбласть.Параметры.Часы 		= Выборка.РабочиеЧасы;
		текОбласть.Параметры.РабочиДни	= Выборка.РабочииДни;
		текОбласть.Параметры.стЧасы 	= Новый Структура("Месяц,РабочиеЧасы"
		,Выборка.Месяц,Выборка.РабочиеЧасы);
		текОбласть.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(текОбласть);
	КонецЦикла;
	

КонецПроцедуры // СформироватьТаблицу()

&НаКлиенте
Процедура ПолеВыводвОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ПФ = ПолучитьФорму("Отчет.РабочиеЧасы.Форма.ФормаДобавитьРабочиеЧасы");
	ПФ.НачалоПериода = ЭтаФорма.Период.ДатаНачала;
	ПФ.ОкончаниеПериода = ЭтаФорма.Период.ДатаОкончания;
	ПФ.ТекущийМесяц = Расшифровка.Месяц;
	ПФ.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ДатаСохранена" Тогда
		СформироватьТаблицу();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СформироватьТаблицу();
КонецПроцедуры
